title: Resource Exposed to All Users or All Auth Users
id: 249c3646-30aa-45d1-b235-8d2c7f6240ea
status: test
description: Detects an IAM policy which granting access to all users (public) or all authenticated Google users.
author: asafaprozper
date: 2022/11/01
tags:
    - attack.initial_access
    - attack.t1190
logsource:
    product: gcp
    service: "*.googleapis.com"
detection:
    selection_source:
        data.protoPayload.methodName|contains:
            - "SetIam"
        data.protoPayload.serviceData.policyData.bindingDeltas.member: 
            - "allUsers"
            - "allAuthenticatedUsers"
        data.protoPayload.serviceData.policyData.bindingDeltas.action:
            - "ADD"
    condition: selection_source
falsepositives:
    - not found any
level: high